package com.project.xiaodong.fflibrary.constants;

/**
 * Created by xiaodong.jin on 2018/3/14.
 * description：设备信息类
 */

public class DeviceInfo {
    /*******************************************************************************
     *	Public/Protected Variables
     *******************************************************************************/

    /**
     * 屏幕分辨率宽度
     */
    public static int WIDTHPIXELS = 800;
    /**
     * 屏幕分辨率高度
     */
    public static int HEIGHTPIXELS = 640;
    /**
     * 屏幕密度
     */
    public static int DENSITYDPI = 240;
    public static float DENSITY = 1.5f;
    /** 设备型号 */
    public static String DEVICE_MODEL = android.os.Build.MODEL;
    /** 系统SDK版本号 */
    public static String SYSTEM_SDK_VERSION = String.valueOf(android.os.Build.VERSION.SDK_INT);
    /*******************************************************************************
     *	Private Variables
     *******************************************************************************/

    /*******************************************************************************
     *	Overrides From Base
     *******************************************************************************/

    /*******************************************************************************
     *	Public/Protected Methods
     *******************************************************************************/

    /*******************************************************************************
     *	Private Methods
     *******************************************************************************/

    /*******************************************************************************
     *	Internal Class,Interface
     *******************************************************************************/
}
